Repository: remram44/yoppi
Catalog: yoppi/locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: seconds
fr: secondes

source: hours
fr: heures

source: days
fr: jours

source: weeks
fr: semaines

source: just now
fr: à l'instant

source: %s is still online
fr: %s est toujours en ligne

source: %s is now online
fr: %s est maintenant en ligne

source: discovered new server at %s
fr: découverte d'un nouveau serveur à %s

source: %s is still offline
fr: %s est toujours hors-ligne

source: %s is now offline
fr: %s est maintenant hors-ligne

source: %s didn't respond
fr: %s n'a pas répondu

source: Nothing matches '%s'
fr: Rien ne correspond à "%s"

source: Indexing '%s'...
fr: Indexation de "%s"...

source: server %s doesn't seem to handle unicode. Brace yourselves.
fr: le serveur %s n'a pas l'air de supporter unicode. Attention les yeux...

source: %(nb_files)d files found on %(address)s, %(total_size)d b
fr: %(nb_files)d fichiers trouvés sur %(address)s, %(total_size)d o

source: %(ins)d insertions, %(dele)d deletions
fr: %(ins)d insertions, %(dele)d suppressions

source: got error indexing %(server)s: %(error)s
fr: erreur pendant l'indexation de %(server)s : %(error)s

source: %s is offline, not indexing.
fr: %s est hors-ligne, n'indexe pas.

source: Warning: parse_ip_range(): got two addresses, assuming a range rather than two distinct addresses Wrap them inside a tuple to remove this warning, eg: 'IP_RANGES': ( ('{0!s}', '{1!s}'), ), instead of: 'IP_RANGES': ( '{0!s}', '{1!s}' ),
fr: Attention : parse_ip_range() : obtenu deux adresses, utilisation d'une plage plutôt que de deux adresses distinctes. Placez-les dans un tuple pour supprimer ce warning, par ex : 'IP_RANGES': ( ('{0!s}', '{1!s}'), ), au lieu de : 'IP_RANGES': ( '{0!s}', '{1!s}' ),

source: %(server)s's directory depth is more than %(max_depth)d. It doesn't seem legit.
fr: la profondeur de répertoires de %(server)s est supérieure à %(max_depth)d. Ca n'a pas l'air normal.

source: %(server)s has more than %(max_files)d files. It doesn't seem legit.
fr: %(server)s a plus de %(max_files)d fichiers. Ca n'a pas l'air normal.

# 'checkstatus' command
source: Check all known servers
fr: Vérifie tous les serveurs connus

# args for 'checkstatus' command
source: <server_address> [server_address [...]]
fr: <adresse> [adresse [...]]

# help for 'checkstatus' command
source: Check the availability of all known servers
fr: Vérifie la disponibilité de tous les serveurs connus

# help for 'cron' command
source: called regularly to perform the actions configured in settings.py
fr: appelé régulièrement pour effectuer les tâches configurées dans settings.py

# 'index' command
source: Index all known ftps
fr: Indexe tous les ftps connus.

# args for 'index' command
source: <server_address> [server_address [...]]
fr: <adresse_serveur> [adresse_serveur [...]]

# help for 'index' command
source: (re-)index the specified FTP server
fr: (ré-)indexe le serveur FTP spécifié

source: Error: %s
fr: Erreur : %s

source: %s is already being indexed
fr: %s est déjà en cours d'indexations

source: Expected 2 parameters, got %d
fr: 2 paramètres attendus, %d reçus

source: Error 404
fr: Erreur 404

source: The page you asked for couldn't be found.
fr: La page que vous avez demandée n'a pas pu être trouvée.

source: Error 500
fr: Erreur 500

source: There was an error processing your request. We have been notified and will examine the problem shortly.
fr: Il y a eu une erreur pendant le traitement de votre requête. Nous en avons été notifiés et examinerons le problème rapidement.

source: Search
fr: Recherche

source: Yoppi Indexer on <a href="%(project_url)s">github.com</a>
fr: Yoppi Indexer sur <a href="%(project_url)s">github.com</a>

# file name table header
source: Name
fr: Nom

# file size table header
source: Size
fr: Taille

# server name table header
source: Server
fr: Serveur

source: No files to show
fr: Aucun fichier à afficher

source: FTP index - Yoppi
fr: Index des FTP - Yoppi

source: Welcome to Yoppi!
fr: Bienvenue sur Yoppi !

source: You can search for files on the ftps using the search dialog in the right upper corner, or browse the content of the ftp on the left.
fr: Vous pouvez chercher des fichiers sur les ftps en utilisant la boîte de dialogue dans le coin en haut à droite, ou explorer le contenu d'un ftp sur la gauche.

source: Search results - Yoppi
fr: Résultats de recherche - Yoppi

source: Search:
fr: Recherche :

# previous page
source: previous
fr: précédent

source: Page %(number)s of %(num_pages)s
fr: Page %(number)s sur %(num_pages)s

# next page
source: next
fr: suivant

source: Listing - %(server_name)s - Yoppi
fr: Liste - %(server_name)s - Yoppi
